[
    {
      "blogTitle": "Strategic Preparation for Oracle Supply Chain Roles: An MBA Student’s Journey",
      "blogDescription": "As an MBA student specializing in Operations and Supply Chain Management, I am committed to developing the expertise and skills necessary to thrive in a competitive job market, with a particular focus on opportunities at Oracle. To achieve this, I have aligned my academic pursuits and projects with Oracle’s priorities. Oracle’s Supply Chain Management Cloud platform offers businesses advanced tools to streamline supply chain operations using cutting-edge technologies such as AI, IoT, and machine learning. This specialization provides a pathway to work with these transformative technologies that are redefining global supply chain practices. My academic projects have focused on practical applications such as optimizing warehouse layouts to improve operational efficiency and implementing demand forecasting strategies to minimize stockouts. To enhance my capabilities further, I have obtained certifications in Six Sigma Green Belt, SAP in Supply Chain Management, and Blockchain applications in supply chains. In addition to academic and technical growth, I actively engage on LinkedIn to deepen my industry insights, sharing updates on supply chain trends like the anticipated $380 billion expansion of India’s logistics sector by 2025. By connecting with Oracle professionals and industry leaders, I aim to bridge the gap between theoretical knowledge and real-world applications. Through continuous upskilling, a proactive approach, and a strong academic foundation, I am prepared to address logistics and supply chain challenges with innovative solutions. My ultimate goal is to contribute meaningfully to Oracle’s supply chain initiatives and secure a position at my dream organization.",
      "bulletPoints": [""]
    },
    {
      "blogTitle": "My Journey Towards Excellence in Operations and Supply Chain Management ",
      "blogDescription": "Hello! I’m VeenaGhaisas, a dedicated professional and lifelong learner with a passion for enhancing supply chain processes through technology and innovation. My journey has been a blend of academic achievements, professional experiences, and a commitment to creating impactful solutions in the field of operations and supply chain management. My academic background has been pivotal in shaping my professional path. I graduated with a Bachelor of Engineering in Electronics and Telecommunication from Savitribai Phule Pune University, where I achieved a CGPA of 8.06, showcasing my consistent academic performance. Currently, I am pursuing an MBA in Operations and Supply Chain Management at MIT World Peace University, delving deep into strategic business practices and operational frameworks. This program is equipping me with the expertise to address complex challenges in the global supply chain industry, projected to grow to $9.87 trillion by 2025. My career began at Accenture, where I worked as an Application Development Associate for nearly a year. During this time, I developed expertise in Oracle Customer Data Management (CDM), focusing on data profiling, cleansing, and governance. I also contributed to improving user adoption rates by training team members and addressing data-related issues. Through this role, I honed my programming skills in Python and Groovy and gained hands-on experience with tools like SQL and Oracle ERP. I actively contributed to maintaining data accuracy, reducing errors by 30%, and streamlining processes that enhanced team efficiency.",
      "bulletPoints": [""]
    }
  ]
  